# Cleaning Data

Each row should represent one observation belonging to a particular category/instance so it is easier to work with for analytical purposes as it is granular in nature.

Each column is considered a variable with multiple distinct values across which we can derive certain insights and prepare reports from our data set.

In [311]:
import pandas as pd
import glob

## Compliling several data files into one DataFrame
In order to make one large DataFrame (df) out of several files, assuming they all hold the same kind of information, can use glob.

In [312]:
student_files = glob.glob("exams*.csv")#read all file names in current directory starting with exams

df_list = []
for filename in student_files:
  data = pd.read_csv(filename)
  df_list.append(data)
    
students = pd.concat(df_list)

student_files

['exams6.csv',
 'exams7.csv',
 'exams5.csv',
 'exams4.csv',
 'exams0.csv',
 'exams1.csv',
 'exams3.csv',
 'exams2.csv',
 'exams9.csv',
 'exams8.csv']

In [313]:
students.head()

   id          full_name gender_age fractions probability       grade
0   0     Moses Kirckman        M14       69%         89%  11th grade
1   1    Timofei Strowan        M18       63%         76%  11th grade
2   2       Silvain Poll        M18       69%         77%   9th grade
3   3     Lezley Pinxton        M18       NaN         72%  11th grade
4   4  Bernadene Saunper        F17       72%         84%  11th grade

In [314]:
len(students)

1000

Print out the column names:

In [315]:
students.columns

Index(['id', 'full_name', 'gender_age', 'fractions', 'probability', 'grade'], dtype='object')

### Reorganise the data
At the moment the colums are not individual variables and the rows are not specific enough observations for a given instance, in this case the student name.

There is a column for the scores on the fractions exam, and a column for the scores on the probabilities exam.

We want to make each row an observation, so we want to transform this table to look like:

 |full_name|exam|
 |-------:|:------|
|“First Student”|“Fractions"|
|“First Student”|“Probabilities"|
|“Second Student”|	“Fractions”|
|“Second Student”|	“Probabilities”|	

Use pd.melt() to create a new table (still called students) that follows this structure.<br/>
the syntax is:<br/>
```python
pd.melt(frame=df,
        id_vars['Columns of the old df you want to preserve'],
        value_vars=['Columns in old df you want to turn into variables'],
        value_name['What to call the column of the new df that stores the values '],
        var_name=['What to call the column of the new df that stores the variables
```

In [316]:
students_melted = pd.melt(frame=students,
                          id_vars=['full_name', 'gender_age', 'grade'],
                          value_vars=['fractions','probability'],
                          value_name="score", var_name="exam")
students_melted.head()

           full_name gender_age       grade       exam score
0     Moses Kirckman        M14  11th grade  fractions   69%
1    Timofei Strowan        M18  11th grade  fractions   63%
2       Silvain Poll        M18   9th grade  fractions   69%
3     Lezley Pinxton        M18  11th grade  fractions   NaN
4  Bernadene Saunper        F17  11th grade  fractions   72%

Now each row has specific information for each instance, so each student will have 2 rows now, one for each exam they took.

In [317]:
students_melted.exam.value_counts()

probability    1000
fractions      1000
Name: exam, dtype: int64

As seen above, there are 1000 entries for probability and 1000 entries for fractions, esentially doubleing the data, but now it is more granular and easier to process.

## Checking for duplicate Rows
Now we are going to check for duplicate rows, as you can see in this case, index 11 is a duplicate

In [318]:
students_melted.head(13)

            full_name gender_age       grade       exam score
0      Moses Kirckman        M14  11th grade  fractions   69%
1     Timofei Strowan        M18  11th grade  fractions   63%
2        Silvain Poll        M18   9th grade  fractions   69%
3      Lezley Pinxton        M18  11th grade  fractions   NaN
4   Bernadene Saunper        F17  11th grade  fractions   72%
5       Eldin Spitell        M16  11th grade  fractions   NaN
6      Christi Lesser        F17   9th grade  fractions   86%
7     Papageno Rummin        M17  11th grade  fractions   81%
8    Nissa Wrotchford        F18  12th grade  fractions   68%
9      Vincent Blumer        M14  11th grade  fractions   59%
10   Roanne Blomfield        F14  11th grade  fractions   72%
11   Roanne Blomfield        F14  11th grade  fractions   72%
12      Lyda Gandrich        F16  12th grade  fractions   71%

You can create a series (a column) showing a boolian value if the row contains a duplicate entry or not.

In [319]:
duplicates = students_melted.duplicated()
duplicates.head(15)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
12    False
13    False
14    False
dtype: bool

Here we can count how many duplicates it found.

In [320]:
duplicates.value_counts()

False    1976
True       24
dtype: int64

now we can make a df with the duplicates dropped. In this case we changed the original variable name.

In [321]:
students = students_melted.drop_duplicates()
students.head(13)

            full_name gender_age       grade       exam score
0      Moses Kirckman        M14  11th grade  fractions   69%
1     Timofei Strowan        M18  11th grade  fractions   63%
2        Silvain Poll        M18   9th grade  fractions   69%
3      Lezley Pinxton        M18  11th grade  fractions   NaN
4   Bernadene Saunper        F17  11th grade  fractions   72%
5       Eldin Spitell        M16  11th grade  fractions   NaN
6      Christi Lesser        F17   9th grade  fractions   86%
7     Papageno Rummin        M17  11th grade  fractions   81%
8    Nissa Wrotchford        F18  12th grade  fractions   68%
9      Vincent Blumer        M14  11th grade  fractions   59%
10   Roanne Blomfield        F14  11th grade  fractions   72%
12      Lyda Gandrich        F16  12th grade  fractions   71%
13        Wanda Ivens        F18  10th grade  fractions   85%

We can see that the duplicate row has been dropped.

In [322]:
duplicates = students.duplicated()
duplicates.head(15)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
12    False
13    False
14    False
15    False
dtype: bool

When we now do a .value_counts() it finds no duplicates.

In [323]:
duplicates.value_counts()

False    1976
dtype: int64

## Seperating combined data from one column into other columns
In this case, the column gender_age contains combined information that we may want to split and do analysis on. The format is constant throughout the column so this is east to do.

In [324]:
students['gender_age'].head()

0    M14
1    M18
2    M18
3    M18
4    F17
Name: gender_age, dtype: object

In [325]:
students.head()

           full_name gender_age       grade       exam score
0     Moses Kirckman        M14  11th grade  fractions   69%
1    Timofei Strowan        M18  11th grade  fractions   63%
2       Silvain Poll        M18   9th grade  fractions   69%
3     Lezley Pinxton        M18  11th grade  fractions   NaN
4  Bernadene Saunper        F17  11th grade  fractions   72%

In oreder to create two new colums with the sting slice of the existing column, we will create a new df (split_df) with two columns containing the information we require. Remember the second number of the slice is non inclusive and the first index of a string is 0.

In [326]:
split_df = pd.DataFrame()
split_df['gender'] = students.gender_age.str[0:1]
split_df['age'] = students.gender_age.str[1:3]
split_df.head()

  gender age
0      M  14
1      M  18
2      M  18
3      M  18
4      F  17

Now we can concatonnate the two df's back togeather. Remember to use axis=1 to join them side by side, otherwise it would try and add it to the bottom!

In [327]:
students = pd.concat([students, split_df,], axis=1)
students.head()

           full_name gender_age       grade       exam score gender age
0     Moses Kirckman        M14  11th grade  fractions   69%      M  14
1    Timofei Strowan        M18  11th grade  fractions   63%      M  18
2       Silvain Poll        M18   9th grade  fractions   69%      M  18
3     Lezley Pinxton        M18  11th grade  fractions   NaN      M  18
4  Bernadene Saunper        F17  11th grade  fractions   72%      F  17

Now we can ammend the df so that it contains the coulumns that we want:

In [328]:
students = students[['full_name', 'grade', 'exam', 'score', 'gender', 'age']]
students.head()

           full_name       grade       exam score gender age
0     Moses Kirckman  11th grade  fractions   69%      M  14
1    Timofei Strowan  11th grade  fractions   63%      M  18
2       Silvain Poll   9th grade  fractions   69%      M  18
3     Lezley Pinxton  11th grade  fractions   NaN      M  18
4  Bernadene Saunper  11th grade  fractions   72%      F  17

We can also split columns on cirtain characters. In this case we want to split full_name on the space into two columns for first and last name. This puts the split string into a list.

In [329]:
name_split = students['full_name'].str.split(" ")
name_split.head()

0       [Moses, Kirckman]
1      [Timofei, Strowan]
2         [Silvain, Poll]
3       [Lezley, Pinxton]
4    [Bernadene, Saunper]
Name: full_name, dtype: object

We can then access the index of the list and make it equal to a new column name in our students df.

In [330]:
students['first_name'] = name_split.str.get(0)
students['last_name'] = name_split.str.get(1)
students.head()

,full_name,grade,exam,score,gender,age,first_name,last_name
0,Moses Kirckman,11th grade,fractions,69%,M,14,Moses,Kirckman
1,Timofei Strowan,11th grade,fractions,63%,M,18,Timofei,Strowan
2,Silvain Poll,9th grade,fractions,69%,M,18,Silvain,Poll
3,Lezley Pinxton,11th grade,fractions,NaN,M,18,Lezley,Pinxton
4,Bernadene Saunper,11th grade,fractions,72%,F,17,Bernadene,Saunper

## Looking at Data Types
Sometimes the Data might not be in the format of how we want to work with it. For example numbers may actually be strings or objects etc. We can view the data type by df.dtypes. In the example below the data types are objects, we want strings and integers.

In [331]:
students.dtypes

full_name     object
grade         object
exam          object
score         object
gender        object
age           object
first_name    object
last_name     object
dtype: object

As you can see, methods like 'mean' (calc the average) will not work properly.

In [332]:
students.score.mean

<bound method Series.mean of 0       69%
1       63%
2       69%
3       NaN
4       72%
5       NaN
6       86%
7       81%
8       68%
9       59%
10      72%
12      71%
13      85%
14      69%
15      77%
16      76%
18      NaN
19      86%
20      72%
21      81%
22      78%
23      NaN
24      67%
25      70%
26      61%
27      74%
28      76%
29      77%
30      68%
31      71%
       ...
1970    80%
1971    75%
1972    81%
1973    78%
1974    85%
1975    80%
1976    86%
1977    86%
1978    91%
1979    79%
1980    72%
1981    79%
1982    88%
1983    87%
1984    83%
1985    76%
1986    77%
1987    82%
1988    90%
1989    77%
1990    66%
1991    79%
1992    76%
1993    79%
1994    91%
1995    69%
1996    86%
1997    82%
1998    84%
1999    91%
Name: score, Length: 1976, dtype: object>

First we can remove the % sign using Regex:

In [333]:
students.score = students.score.replace('[\%]', '',regex=True)
students.score.head()

0     69
1     63
2     69
3    NaN
4     72
Name: score, dtype: object

Then we can use pd.to_numeric(the column we want to change to a numeric value). In this case we change score to a float as it is a decimal number.

In [334]:
students.score = pd.to_numeric(students.score)
students.dtypes

full_name      object
grade          object
exam           object
score         float64
gender         object
age            object
first_name     object
last_name      object
dtype: object

## More string parsing
Sometimes we want to do analysis on numbers that are hidden within string values. We can use regex to extract this numerical data from the strings they are trapped in. In this example we want the grade number separate. This only works if the format is the same in each row.

In [335]:
students.grade.head()

0    11th grade
1    11th grade
2     9th grade
3    11th grade
4    11th grade
Name: grade, dtype: object

First we will creat a variable containing the split string in different columns using Regex.

In [336]:
split_df = students.grade.str.split('(\d+)', expand=True)
split_df.head()

  0   1         2
0    11  th grade
1    11  th grade
2     9  th grade
3    11  th grade
4    11  th grade

We will the set the grade column in the students df to the numeric version of the split_df of column 1.

In [337]:
students.grade = pd.to_numeric(split_df[1])
students.grade.head()

0    11
1    11
2     9
3    11
4    11
Name: grade, dtype: int64

The data type has changed to int as they are all whole numbers.

In [338]:
students.dtypes

full_name      object
grade           int64
exam           object
score         float64
gender         object
age            object
first_name     object
last_name      object
dtype: object

Viewing the whole table again we can see the value of the grade column is now just the number.

In [339]:
students.head()

           full_name  grade       exam  score gender age first_name last_name
0     Moses Kirckman     11  fractions   69.0      M  14      Moses  Kirckman
1    Timofei Strowan     11  fractions   63.0      M  18    Timofei   Strowan
2       Silvain Poll      9  fractions   69.0      M  18    Silvain      Poll
3     Lezley Pinxton     11  fractions    NaN      M  18     Lezley   Pinxton
4  Bernadene Saunper     11  fractions   72.0      F  17  Bernadene   Saunper

## Missing values
We often have data with missing elements, as a result of a problem with the data collection process or errors in the way the data was stored. The missing elements normally show up as NaN (or Not a Number). Some calculations we do will just skip the NaN values, but some calculations or visualizations we try to perform will break when a NaN is encountered. Most of the time, we use one of two methods to deal with missing values.

Method 1: Drop all of the rows with a missing value<br/>
```df = df.dropna()```<br/>
Method 2: Fill the missing values with the mean of the column, or with some other aggregate value.

We can see there are NaN values in the score column.

In [340]:
students.score.head(10)

0    69.0
1    63.0
2    69.0
3     NaN
4    72.0
5     NaN
6    86.0
7    81.0
8    68.0
9    59.0
Name: score, dtype: float64

This is what we get when we calculate the mean value of the scores.

In [341]:
score_mean = students.score.mean()
score_mean

77.69657422512235

We will assume that if the value is NaN then the student missed the exam and we will set the score to 0.

In [342]:
students.score = students.score.fillna(0)
students.score.head(10)

0    69.0
1    63.0
2    69.0
3     0.0
4    72.0
5     0.0
6    86.0
7    81.0
8    68.0
9    59.0
Name: score, dtype: float64

Now the mean is more accurate

In [344]:
score_mean_2 = students.score.mean()
score_mean_2

72.30971659919028